{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "db2b7052",
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph \n",
    "import pandas as pd\n",
    "from collections import defaultdict\n",
    "import json\n",
    "import re"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "4ec957cf",
   "metadata": {},
   "outputs": [],
   "source": [
    "class neo4jUtil:\n",
    "    def __init__(self):\n",
    "        self.driver = Graph(\"neo4j://172.16.231.80:7687\", auth=(\"neo4j\", \"123456\"))\n",
    "\n",
    "    def run_cypher(self, cypher):\n",
    "        result_list = self.driver.run(cypher).data()\n",
    "        return result_list\n",
    "    \n",
    "n_util = neo4jUtil()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "e98c651d",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_warning = pd.read_csv(\"processed/fda_warning_with_chemical.csv\")[[\"match_chemical_list\", \"link\"]]\n",
    "df_warning = df_warning[~df_warning['match_chemical_list'].isnull()]\n",
    "warning_dict = defaultdict(list)\n",
    "\n",
    "for index, row in df_warning.iterrows():\n",
    "    chem = row[\"match_chemical_list\"]\n",
    "    link = row[\"link\"]\n",
    "    warning_dict[chem].append(link)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "961b4ef5",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_drug = pd.DataFrame({\"drug\": list(set(pd.read_csv(\"drug_report/report_chemicals.csv\")[\"Drug\"].values))})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "2113d765",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_translation = pd.read_csv(\"processed/chemical_translation.csv\", dtype=str).fillna(\"\")\n",
    "df_translation[\"chemical_name\"] = df_translation[\"chemical_name\"].str.strip().str.lower() \n",
    "df_translation[\"cn_chemical_name\"] = df_translation[\"cn_chemical_name\"].str.strip().str.lower()\n",
    "\n",
    "df_drug = pd.merge(df_drug, df_translation, how=\"left\", left_on=[\"drug\"], \n",
    "                   right_on=[\"chemical_name\"])[[\"chemical_name\", \"cn_chemical_name\"]].fillna(\"\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "5adb9523",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_pc_label(chemical_name):\n",
    "    # phenotype category label\n",
    "    query_template = \"\"\"\n",
    "    match (m:chemical {{chemical_name: \"{chem_name}\"}})<-[r:clinical_annotation]-()\n",
    "    return distinct r.phenotype_category as phenotype_category\n",
    "    union\n",
    "    match (m:chemical {{chemical_name: \"{chem_name}\"}})<-[r:research_annotation]-()\n",
    "    return distinct r.phenotype_category as phenotype_category\n",
    "    \"\"\".format(chem_name=chemical_name)\n",
    "    result = n_util.run_cypher(query_template)\n",
    "\n",
    "    toxicity_flag = False\n",
    "    efficacy_flag = False\n",
    "    dosage_flag = False\n",
    "    metabolism_flag = False\n",
    "    # label_code pc_toxicity, pc_efficacy, pc_dosage, pc_metabolism\n",
    "    for x in [res[\"phenotype_category\"].lower() for res in result]:\n",
    "        if \"toxicity\" in x:\n",
    "            toxicity_flag = True\n",
    "        if \"efficacy\" in x:\n",
    "            efficacy_flag = True\n",
    "        if \"dosage\" in x:\n",
    "            dosage_flag = True\n",
    "        if \"metabolism\" in x:\n",
    "            metabolism_flag = True\n",
    "    return [toxicity_flag, efficacy_flag, dosage_flag, metabolism_flag]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "40a01ead",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_cn_drug_label(chemical_name):\n",
    "    # cn_drug_label\n",
    "    query_template = \"\"\"\n",
    "    match (m:chemical {{chemical_name: \"{chem_name}\"}})<-[r:cn_drug_label]-(ge:gene)\n",
    "    return m.chemical_name as chemical_name, ge.gene_name as gene_name, r.remark as remark\n",
    "    \"\"\".format(chem_name=chemical_name)\n",
    "    result = n_util.run_cypher(query_template)\n",
    "\n",
    "    cn_drug_label_flag = False\n",
    "    genes = \"\"\n",
    "    if len(result) > 0:\n",
    "        cn_drug_label_flag = True\n",
    "        genes = \",\".join([x[\"gene_name\"] for x in result])\n",
    "        \n",
    "    return [cn_drug_label_flag, genes]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "id": "fc8bf086",
   "metadata": {},
   "outputs": [],
   "source": [
    "def fda_warning_insurance_label(chemical_name):\n",
    "    # FDA warning and medical_insurance\n",
    "    warning_link = \"\"\n",
    "    fda_warning_flag = False\n",
    "    \n",
    "    if chemical_name in warning_dict.keys():\n",
    "        fda_warning_flag = True\n",
    "        warning_link = \" | \".join(warning_dict[chemical_name])\n",
    "\n",
    "    query_template = \"\"\"\n",
    "    match (m:chemical {{chemical_name: \"{chem_name}\"}})-[r:chemical_drug_relation]->(n:drug)\n",
    "    return distinct n.in_medical_insurance as in_medical_insurance, n.insurance_level as insurance_level\n",
    "    \"\"\".format(chem_name=chemical_name)\n",
    "    result = n_util.run_cypher(query_template)\n",
    "    is_insurance = [x[\"in_medical_insurance\"] for x in result]\n",
    "    level = [x[\"insurance_level\"] for x in result]\n",
    "\n",
    "    insurance_flag = False\n",
    "    insurance_level = \"\"\n",
    "\n",
    "    if \"是\" in is_insurance:\n",
    "        insurance_flag = True\n",
    "        insurance_level = \",\".join(set(filter(lambda x: x != \"\", level)))\n",
    "        \n",
    "    return [fda_warning_flag, warning_link, insurance_flag, insurance_level]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "4b2e4b75",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_atc_info(chemical_name):\n",
    "    # ATC code\n",
    "    query_template = \"\"\"\n",
    "    match (m:chemical {{chemical_name: \"{chem_name}\"}})\n",
    "    return m.atc_code as atc_code, m.L1_info as L1_info, m.L1_info_chn as L1_info_chn,\n",
    "    m.L2_info as L2_info, m.L2_info_chn as L2_info_chn,\n",
    "    m.L3_info as L3_info, m.L3_info_chn as L3_info_chn,\n",
    "    m.L4_info as L4_info, m.L4_info_chn as L4_info_chn\n",
    "    \"\"\".format(chem_name=chemical_name)\n",
    "    result = n_util.run_cypher(query_template)\n",
    "    \n",
    "    if len(result) == 0:\n",
    "        return [\"\"] * 9\n",
    "    \n",
    "    result = result[0]\n",
    "    return [result['atc_code'], result['L1_info'], result['L1_info_chn'], result['L2_info'], result['L2_info_chn'],\n",
    "            result['L3_info'], result['L3_info_chn'], result['L4_info'], result['L4_info_chn']]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9e9154fc",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "id": "18dedcab",
   "metadata": {},
   "outputs": [],
   "source": [
    "cn_drug_label_list = []\n",
    "drug_label_gene_list = []\n",
    "fda_warning_flag_list = []\n",
    "insurance_flag_list = []\n",
    "insurance_level_list = []\n",
    "atc_code_list = []\n",
    "L1_info_list = []\n",
    "L1_info_chn_list = []\n",
    "L2_info_list = []\n",
    "L2_info_chn_list = []\n",
    "L3_info_list = []\n",
    "L3_info_chn_list = []\n",
    "L4_info_list = []\n",
    "L4_info_chn_list = []\n",
    "toxicity_flag_list = []\n",
    "efficacy_flag_list = []\n",
    "dosage_flag_list = []\n",
    "metabolism_flag_list = []\n",
    "fda_warning_link_list = []\n",
    "\n",
    "for index, row in df_drug.iterrows():\n",
    "    chemical_name = row[\"chemical_name\"]\n",
    "    [toxicity_flag, efficacy_flag, dosage_flag, metabolism_flag] = get_pc_label(chemical_name)\n",
    "    [cn_drug_label, genes] = get_cn_drug_label(chemical_name)\n",
    "    [fda_warning_flag, fda_warning_link, insurance_flag, insurance_level] = fda_warning_insurance_label(chemical_name)\n",
    "    [atc_code, L1_info, L1_info_chn, L2_info, L2_info_chn, L3_info, L3_info_chn, L4_info, L4_info_chn] = get_atc_info(chemical_name)\n",
    "    \n",
    "    cn_drug_label_list.append(cn_drug_label)\n",
    "    drug_label_gene_list.append(genes)\n",
    "    fda_warning_flag_list.append(fda_warning_flag)\n",
    "    insurance_flag_list.append(insurance_flag)\n",
    "    insurance_level_list.append(insurance_level)\n",
    "    atc_code_list.append(atc_code)\n",
    "    L1_info_list.append(L1_info)\n",
    "    L1_info_chn_list.append(L1_info_chn)\n",
    "    L2_info_list.append(L2_info)\n",
    "    L2_info_chn_list.append(L2_info_chn)\n",
    "    L3_info_list.append(L3_info)\n",
    "    L3_info_chn_list.append(L3_info_chn)\n",
    "    L4_info_list.append(L4_info)\n",
    "    L4_info_chn_list.append(L4_info_chn)\n",
    "    toxicity_flag_list.append(toxicity_flag)\n",
    "    efficacy_flag_list.append(efficacy_flag)\n",
    "    dosage_flag_list.append(dosage_flag)\n",
    "    metabolism_flag_list.append(metabolism_flag)\n",
    "    fda_warning_link_list.append(fda_warning_link)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "id": "7f5daf10",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_label = pd.DataFrame({\n",
    "    \"中国药物标签\": cn_drug_label_list,\n",
    "    \"中国药物基因影响\": drug_label_gene_list,\n",
    "    \"FDA预警标签\": fda_warning_flag_list,\n",
    "    \"FDA预警链接\": fda_warning_link_list,\n",
    "    \"医保标签\": insurance_flag_list,\n",
    "    \"医保级别\": insurance_level_list,\n",
    "    \"ATC代码\": atc_code_list,\n",
    "    \"ATC level 1\": L1_info_list,\n",
    "    \"ATC level 1 中文\": L1_info_chn_list,\n",
    "    \"ATC level 2\": L2_info_list,\n",
    "    \"ATC level 2 中文\": L2_info_chn_list,\n",
    "    \"ATC level 3\": L3_info_list,\n",
    "    \"ATC level 3 中文\": L3_info_chn_list,\n",
    "    \"ATC level 4\": L4_info_list,\n",
    "    \"ATC level 4 中文\": L4_info_chn_list,\n",
    "}).fillna(\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "adbf8527",
   "metadata": {},
   "outputs": [],
   "source": [
    "pd.concat([df_drug, df_label], axis=1).to_csv(\"drug_report/report_label.csv\", index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "33e46a50",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "0dc9271d",
   "metadata": {},
   "outputs": [],
   "source": [
    "for index, row in pd.read_csv(\"processed/drug_chemical.csv\", encoding=\"utf-8\", dtype=str).fillna(\"\").iterrows():\n",
    "    cn_name = row[\"cn_chemical_name\"].strip()\n",
    "    drug_name = row[\"chn_name\"].strip()\n",
    "    en_name = row[\"chemical\"].lower()\n",
    "    en_drug_name = row[\"eng_name\"].lower()\n",
    "    \n",
    "    if cn_name not in drug_name and en_name not in en_drug_name:\n",
    "        print(\"{} -- {}\".format(cn_name, drug_name))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "3282f92b",
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "import json\n",
    "with open(\"c:/Users/zhangke1/Downloads/records.json\", \"r\", encoding=\"utf-8\") as f:\n",
    "    content = f.read()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "273af0ee",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_pharmacology = pd.read_csv(\"c:/Users/zhangke1/Downloads/export.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "5558ccf5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>drug_name</th>\n",
       "      <th>pharmacology_toxicology</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>琥乙红霉素片</td>\n",
       "      <td>本品属大环内酯类抗生素，为红霉素的琥珀酸乙酯，在胃酸中较红霉素稳定。对葡萄球菌属(耐甲氧西林...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>琥乙红霉素颗粒</td>\n",
       "      <td>本品属大环内酯类抗生素，为红霉素的琥珀酸乙酯，在胃酸中较红霉素稳定。对葡萄球菌属(耐甲氧西林...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>红霉素肠溶片</td>\n",
       "      <td>本品属大环内酯类抗生素。对葡萄球菌属(耐甲氧西林菌株除外)、各组链球菌和革兰阳性杆菌均具抗菌...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>布美他尼片</td>\n",
       "      <td>对水和电解质排泄的作用基本同呋塞米，其利尿作用为呋塞米20～60倍。主要抑制肾小管髓袢升支厚...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>注射用布美他尼</td>\n",
       "      <td>对水和电解质的排泄作用基本同呋塞米，其利尿作用为呋塞米的20～60倍。主要抑制肾小管髓袢升支...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5227</th>\n",
       "      <td>左羟丙哌嗪胶囊</td>\n",
       "      <td>1.左羟丙哌嗪的镇咳作用；研究了左羟丙哌嗪对麻醉豚鼠和家兔的镇咳作用，结果表明左羟丙哌嗪具有...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5228</th>\n",
       "      <td>左旋卡尼汀注射液</td>\n",
       "      <td>左旋卡尼汀是哺乳动物能量代谢中必需的体内天然物质，其主要功能是促进脂类代谢。在缺血、缺氧时，...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5229</th>\n",
       "      <td>左炔诺孕酮聚己内酯棒</td>\n",
       "      <td>全合成的孕激素。具有较强抑制垂体分泌促性腺激素的作用而抑制排卵；它能使宫黏粘液变稠，阻碍精子...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5230</th>\n",
       "      <td>左旋卡尼汀口服溶液</td>\n",
       "      <td>左旋卡尼汀是哺乳动物能量代谢中必需的体内天然物质，其主要功能是促进脂类代谢。在缺血、缺氧时，...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5231</th>\n",
       "      <td>左旋炔诺孕酮硅胶棒</td>\n",
       "      <td>全合成孕激素。具有较强抑制垂体分泌促性腺激素的作用而抑制排卵，它能使宫颈粘液变稠，阻碍精子穿...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5232 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       drug_name                            pharmacology_toxicology\n",
       "0         琥乙红霉素片  本品属大环内酯类抗生素，为红霉素的琥珀酸乙酯，在胃酸中较红霉素稳定。对葡萄球菌属(耐甲氧西林...\n",
       "1        琥乙红霉素颗粒  本品属大环内酯类抗生素，为红霉素的琥珀酸乙酯，在胃酸中较红霉素稳定。对葡萄球菌属(耐甲氧西林...\n",
       "2         红霉素肠溶片  本品属大环内酯类抗生素。对葡萄球菌属(耐甲氧西林菌株除外)、各组链球菌和革兰阳性杆菌均具抗菌...\n",
       "3          布美他尼片  对水和电解质排泄的作用基本同呋塞米，其利尿作用为呋塞米20～60倍。主要抑制肾小管髓袢升支厚...\n",
       "4        注射用布美他尼  对水和电解质的排泄作用基本同呋塞米，其利尿作用为呋塞米的20～60倍。主要抑制肾小管髓袢升支...\n",
       "...          ...                                                ...\n",
       "5227     左羟丙哌嗪胶囊  1.左羟丙哌嗪的镇咳作用；研究了左羟丙哌嗪对麻醉豚鼠和家兔的镇咳作用，结果表明左羟丙哌嗪具有...\n",
       "5228    左旋卡尼汀注射液  左旋卡尼汀是哺乳动物能量代谢中必需的体内天然物质，其主要功能是促进脂类代谢。在缺血、缺氧时，...\n",
       "5229  左炔诺孕酮聚己内酯棒  全合成的孕激素。具有较强抑制垂体分泌促性腺激素的作用而抑制排卵；它能使宫黏粘液变稠，阻碍精子...\n",
       "5230   左旋卡尼汀口服溶液  左旋卡尼汀是哺乳动物能量代谢中必需的体内天然物质，其主要功能是促进脂类代谢。在缺血、缺氧时，...\n",
       "5231   左旋炔诺孕酮硅胶棒  全合成孕激素。具有较强抑制垂体分泌促性腺激素的作用而抑制排卵，它能使宫颈粘液变稠，阻碍精子穿...\n",
       "\n",
       "[5232 rows x 2 columns]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_pharmacology"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "ba591e4a",
   "metadata": {},
   "outputs": [],
   "source": [
    "sent_list = []\n",
    "for index,row in df_pharmacology.iterrows():\n",
    "    sent = row[\"pharmacology_toxicology\"].split(\"。\")[:5]\n",
    "    available_sent_list = []\n",
    "    for s in sent:\n",
    "        if any([True if x in s else False for x in [\"抑制\", \"阻断\", \"具\", \"作用\", \n",
    "                                                    \"有效\", \"减少\", \"降低\", \"增加\", \"促进\"]]) and \"毒理\" not in s:\n",
    "            available_sent_list.append(s)\n",
    "            \n",
    "    sent_list.append(\"。\".join(available_sent_list))\n",
    "\n",
    "df_pharmacology[\"sent\"] = sent_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "3427ea9e",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_pharmacology.to_csv(\"c:/Users/zhangke1/Desktop/药理.csv\", index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2a7a7787",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2a341abe",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "af6fab33",
   "metadata": {},
   "outputs": [],
   "source": [
    "# 药物指南 协会\n",
    "query_template = \"\"\"\n",
    "MATCH ()-[r:guideline_annotation]->(che:chemical) \n",
    "where r.guideline_institute is not null\n",
    "RETURN distinct che.display as chemical_name, r.guideline_institute as guideline_institute, \n",
    "r.guideline_link as guideline_link, r.guideline_name as guideline_name\n",
    "\"\"\"\n",
    "result = n_util.run_cypher(query_template)\n",
    "df_guideline = pd.DataFrame(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "4d7e860e",
   "metadata": {},
   "outputs": [],
   "source": [
    "dpwg_dict = {}\n",
    "for chem, content in df_guideline[df_guideline[\"guideline_institute\"] == \"DPWG_Guideline\"].groupby([\"chemical_name\"]):\n",
    "    links = \"\\n\".join(list(content[\"guideline_link\"].values))\n",
    "    guides = \"\\n\".join(list(content[\"guideline_name\"].values))\n",
    "    dpwg_dict[chem] = [links, guides]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5d733401",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "7f1ee8f2",
   "metadata": {},
   "outputs": [],
   "source": [
    "# 药物标签 协会\n",
    "query_template = \"\"\"\n",
    "MATCH ()-[r:drug_label]->(che:chemical) \n",
    "RETURN distinct che.display as chemical_name,\n",
    "r.organization as organization, r.testing_level as testing_level\n",
    "\"\"\"\n",
    "result = n_util.run_cypher(query_template)\n",
    "df_label = pd.DataFrame(result)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "4d00a0ff",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'EMA', 'FDA', 'HCSC', 'PMDA', 'Swissmedic'}"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "set(df_label[\"organization\"].values)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "e66af27c",
   "metadata": {},
   "outputs": [],
   "source": [
    "ema_dict = {}\n",
    "for chem, content in df_label[df_label[\"organization\"] == \"EMA\"].groupby([\"chemical_name\"]):\n",
    "    testing_levels = \"\\n\".join(list(content[\"testing_level\"].values))\n",
    "    ema_dict[chem] = testing_levels\n",
    "    \n",
    "hcsc_dict = {}\n",
    "for chem, content in df_label[df_label[\"organization\"] == \"HCSC\"].groupby([\"chemical_name\"]):\n",
    "    testing_levels = \"\\n\".join(list(content[\"testing_level\"].values))\n",
    "    hcsc_dict[chem] = testing_levels\n",
    "    \n",
    "pmda_dict = {}\n",
    "for chem, content in df_label[df_label[\"organization\"] == \"PMDA\"].groupby([\"chemical_name\"]):\n",
    "    testing_levels = \"\\n\".join(list(content[\"testing_level\"].values))\n",
    "    pmda_dict[chem] = testing_levels\n",
    "    \n",
    "swissmedic_dict = {}\n",
    "for chem, content in df_label[df_label[\"organization\"] == \"Swissmedic\"].groupby([\"chemical_name\"]):\n",
    "    testing_levels = \"\\n\".join(list(content[\"testing_level\"].values))\n",
    "    swissmedic_dict[chem] = testing_levels"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "d9dcb600",
   "metadata": {},
   "outputs": [],
   "source": [
    "dpwg_flag_list = []\n",
    "dpwg_link_list = []\n",
    "dpwg_name_list = []\n",
    "\n",
    "ema_flag_list = []\n",
    "ema_list = []\n",
    "\n",
    "hcsc_flag_list = []\n",
    "hcsc_list = []\n",
    "\n",
    "pmda_flag_list = []\n",
    "pmda_list = []\n",
    "\n",
    "swissmedic_flag_list = []\n",
    "swissmedic_list = []\n",
    "\n",
    "for chem in df_drug[\"chemical_name\"].values:\n",
    "    if chem in dpwg_dict.keys():\n",
    "        dpwg_flag_list.append(True)\n",
    "        dpwg_link_list.append(dpwg_dict[chem][0])\n",
    "        dpwg_name_list.append(dpwg_dict[chem][1])\n",
    "    else:\n",
    "        dpwg_flag_list.append(False)\n",
    "        dpwg_link_list.append(\"\")\n",
    "        dpwg_name_list.append(\"\")\n",
    "        \n",
    "    if chem in ema_dict.keys():\n",
    "        ema_flag_list.append(True)\n",
    "        ema_list.append(ema_dict[chem])\n",
    "    else:\n",
    "        ema_flag_list.append(False)\n",
    "        ema_list.append(\"\")\n",
    "        \n",
    "    if chem in hcsc_dict.keys():\n",
    "        hcsc_flag_list.append(True)\n",
    "        hcsc_list.append(hcsc_dict[chem])\n",
    "    else:\n",
    "        hcsc_flag_list.append(False)\n",
    "        hcsc_list.append(\"\")\n",
    "        \n",
    "    if chem in pmda_dict.keys():\n",
    "        pmda_flag_list.append(True)\n",
    "        pmda_list.append(pmda_dict[chem])\n",
    "    else:\n",
    "        pmda_flag_list.append(False)\n",
    "        pmda_list.append(\"\")\n",
    "        \n",
    "    if chem in swissmedic_dict.keys():\n",
    "        swissmedic_flag_list.append(True)\n",
    "        swissmedic_list.append(swissmedic_dict[chem])\n",
    "    else:\n",
    "        swissmedic_flag_list.append(False)\n",
    "        swissmedic_list.append(\"\")\n",
    "        \n",
    "df_flag = pd.DataFrame({\n",
    "    \"DPWG指南\": dpwg_flag_list,\n",
    "    \"DPWG指南链接\": dpwg_link_list,\n",
    "    \"DPWG名称\": dpwg_name_list,\n",
    "    \"EMA药物标签\": ema_flag_list,\n",
    "    \"EMA信息\": ema_list,\n",
    "    \"HCSC药物标签\": hcsc_flag_list,\n",
    "    \"HCSC信息\": hcsc_list,\n",
    "    \"PMDA药物标签\": pmda_flag_list,\n",
    "    \"PMDA信息\": pmda_list,\n",
    "    \"Swissmedic药物标签\": swissmedic_flag_list,\n",
    "    \"Swissmedic信息\": swissmedic_list,\n",
    "})\n",
    "\n",
    "pd.concat([df_drug, df_flag], axis=1).to_csv(\"c:/Users/zhangke1/Desktop/drug_flag.csv\", index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "f442a293",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>chemical_name</th>\n",
       "      <th>cn_chemical_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>captopril</td>\n",
       "      <td>卡托普利</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>paromomycin</td>\n",
       "      <td>巴龙霉素</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>tegafur</td>\n",
       "      <td>替加氟</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>doxepin</td>\n",
       "      <td>多塞平</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>azathioprine</td>\n",
       "      <td>硫唑嘌呤</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>264</th>\n",
       "      <td>epirubicin</td>\n",
       "      <td>表柔比星</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265</th>\n",
       "      <td>valbenazine</td>\n",
       "      <td>瓦莱苯嗪</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>266</th>\n",
       "      <td>chloroquine</td>\n",
       "      <td>氯喹</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>267</th>\n",
       "      <td>bupropion</td>\n",
       "      <td>安非他酮</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>268</th>\n",
       "      <td>avatrombopag</td>\n",
       "      <td>阿伐曲泊帕</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>269 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    chemical_name cn_chemical_name\n",
       "0       captopril             卡托普利\n",
       "1     paromomycin             巴龙霉素\n",
       "2         tegafur              替加氟\n",
       "3         doxepin              多塞平\n",
       "4    azathioprine             硫唑嘌呤\n",
       "..            ...              ...\n",
       "264    epirubicin             表柔比星\n",
       "265   valbenazine             瓦莱苯嗪\n",
       "266   chloroquine               氯喹\n",
       "267     bupropion             安非他酮\n",
       "268  avatrombopag            阿伐曲泊帕\n",
       "\n",
       "[269 rows x 2 columns]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_drug"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "efc09e1c",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_en_drug_insurance = pd.read_csv(\"src/cralwer/西药医保.csv\", dtype=str, encoding=\"utf-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "be558d9a",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_report = pd.read_csv(\"drug_report/report_label.csv\").fillna(\"\")[[\"chemical_name\", \"cn_chemical_name\", \"医保级别\"]]\n",
    "\n",
    "ins_list = list(zip(list(df_en_drug_insurance[\"药名\"].values), list(df_en_drug_insurance[\"报销类别\"].values)))\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "3000d7fc",
   "metadata": {},
   "outputs": [],
   "source": [
    "ins_flag_list = []\n",
    "match_d_list = []\n",
    "\n",
    "for drug_name in df_report[\"cn_chemical_name\"].values:\n",
    "    dn_list = list(filter(lambda x: drug_name in x[0], ins_list))\n",
    "    cate = \",\".join(list(set(map(lambda x: x[1], dn_list))))\n",
    "    ins_d = \",\".join(list(set(map(lambda x: x[0], dn_list))))\n",
    "    \n",
    "    ins_flag_list.append(cate)\n",
    "    match_d_list.append(ins_d)\n",
    "    \n",
    "df_report[\"医保级别（新）\"] = ins_flag_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "e04811e6",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_report.to_csv(\"医保标签.csv\", index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7d2c9d97",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "b2da254c",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_cli = pd.read_csv(\"processed/clinical_annotations.tsv\", sep=\"\\t\").fillna(\"\")\n",
    "\n",
    "d_list = []\n",
    "l_list = []\n",
    "\n",
    "for index, row in df_cli.iterrows():\n",
    "    drug = row[\"Drug(s)\"]\n",
    "    level = row[\"Level of Evidence\"]\n",
    "    drug_list = [x.strip() for x in re.split(r\";|,|/\", drug)]\n",
    "    d_list.extend(drug_list)\n",
    "    l_list.extend([level] * len(drug_list))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "2d6f9842",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_cli = pd.DataFrame({\n",
    "    \"drug\": d_list,\n",
    "    \"level\": l_list\n",
    "}).groupby([\"drug\"])[\"level\"].apply(lambda x: \",\".join(sorted(set(x)))).reset_index()\n",
    "\n",
    "df_cli[\"drug\"] = df_cli[\"drug\"].str.strip().str.lower()\n",
    "\n",
    "df_translation = pd.read_csv(\"processed/chemical_translation.csv\", dtype=str).fillna(\"\")\n",
    "\n",
    "df_translation[\"chemical_name\"] = df_translation[\"chemical_name\"].str.strip().str.lower()\n",
    "df_translation[\"cn_chemical_name\"] = df_translation[\"cn_chemical_name\"].str.strip().str.lower()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "08fd1731",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_cli = pd.merge(df_cli, df_translation, how='left', left_on='drug', right_on='chemical_name').fillna(\"\")[[\n",
    "    \"drug\", \"cn_chemical_name\", \"level\"]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "c93f8a9f",
   "metadata": {},
   "outputs": [],
   "source": [
    "ins_flag_list = []\n",
    "match_d_list = []\n",
    "\n",
    "for drug_name in df_cli[\"cn_chemical_name\"].values:\n",
    "    dn_list = list(filter(lambda x: drug_name in x[0], ins_list))\n",
    "    cate = \",\".join(list(set(map(lambda x: x[1], dn_list))))\n",
    "    ins_d = \",\".join(list(set(map(lambda x: x[0], dn_list))))\n",
    "    \n",
    "    ins_flag_list.append(cate)\n",
    "    match_d_list.append(ins_d)\n",
    "    \n",
    "df_cli[\"医保级别\"] = ins_flag_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "3c04e892",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_cli.to_csv(\"clinical_insurance.csv\", index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "eeebc237",
   "metadata": {},
   "outputs": [],
   "source": [
    "import re\n",
    "\n",
    "def clean_drug(drug):\n",
    "    drug_clean = re.sub(r\"[\\(\\)-\\/（）\\-\\[\\]\\s、]\", \"\", drug)\n",
    "    drug_clean = re.sub(r\"[片|注射液|颗粒|滴剂|胶囊|散剂|混悬液|乳剂|剂|膏|丸|口服溶液|口服液|咀嚼|泡腾|分散|凝胶]\",\n",
    "                        \"\", drug_clean)\n",
    "    return drug_clean"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "ff9ff639",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "all relation: 88973\n"
     ]
    }
   ],
   "source": [
    "query_template = \"\"\"\n",
    "MATCH (d:drug)-[r:treatment]->(dis:disease) \n",
    "RETURN d.display as drug, dis.display as disease\n",
    "\"\"\"\n",
    "result_list = n_util.run_cypher(query_template)\n",
    "df_relation = pd.DataFrame(result_list)\n",
    "print(\"all relation: {}\".format(len(df_relation)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "11753f89",
   "metadata": {},
   "outputs": [],
   "source": [
    "query_template = \"\"\"\n",
    "MATCH (d:drug)\n",
    "RETURN d.display as drug, d.indication as indication\n",
    "\"\"\"\n",
    "result_list = n_util.run_cypher(query_template)\n",
    "df_drug = pd.DataFrame(result_list)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "3f5fc849",
   "metadata": {},
   "outputs": [],
   "source": [
    "query_template = \"\"\"\n",
    "MATCH (dis:disease)\n",
    "RETURN dis.display as disease\n",
    "\"\"\"\n",
    "result_list = n_util.run_cypher(query_template)\n",
    "df_disease = pd.DataFrame(result_list)\n",
    "all_disease = list(df_disease[\"disease\"].values)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "a0e39511",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "11963\n"
     ]
    }
   ],
   "source": [
    "df_drug = df_drug.fillna(\"\")\n",
    "df_drug = df_drug[df_drug[\"indication\"] != \"\"]\n",
    "print(len(df_drug))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "ee7425ef",
   "metadata": {},
   "outputs": [],
   "source": [
    "drug_clean = list(map(lambda x: clean_drug(x), df_drug[\"drug\"].values))\n",
    "drug_clean_indication_dict = dict(zip(drug_clean, df_drug[\"indication\"].values))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "4de036ac",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3793\n"
     ]
    }
   ],
   "source": [
    "df_relation = df_relation.groupby([\"drug\"])[\"disease\"].apply(lambda x: list(x)).reset_index()\n",
    "print(len(df_relation))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "12bc4347",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_merge = pd.merge(df_drug, df_relation, how=\"outer\", on=[\"drug\"])\n",
    "df_merge = df_merge.fillna(\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "id": "ea4ac11b",
   "metadata": {},
   "outputs": [],
   "source": [
    "new_disease_list = []\n",
    "new_relation_list = []\n",
    "for index, row in df_merge.iterrows():\n",
    "    drug = row[\"drug\"]\n",
    "    indication = row[\"indication\"]\n",
    "    disease_list = [] if row[\"disease\"] == \"\" else row[\"disease\"]\n",
    "    if indication == \"\":\n",
    "        cd = clean_drug(drug)\n",
    "        if cd in drug_clean_indication_dict.keys():\n",
    "            indication = drug_clean_indication_dict[cd]\n",
    "    \n",
    "    new_disease = list(filter(lambda x: x in indication and x not in disease_list, all_disease))\n",
    "    new_disease_list.append(new_disease)\n",
    "    \n",
    "    for nd in new_disease:\n",
    "        new_relation_list.append([drug, nd])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "ba2f85e9",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_merge[\"new_disease\"] = new_disease_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "id": "2f6e22e9",
   "metadata": {},
   "outputs": [],
   "source": [
    "# df_merge.to_csv(\"c:/Users/zhangke1/Desktop/new_disease.csv\", index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "id": "4bdf4114",
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "with open(\"processed/disease_drug_new_list.json\", \"w\", encoding=\"utf-8\") as f:\n",
    "    json.dump(new_relation_list, f)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "id": "43407cf5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "3215"
      ]
     },
     "execution_count": 84,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 药物基因组适用药物\n",
    "result_list = n_util.run_cypher(\"\"\"match (d:drug)-[]-(m:chemical)<-[]-(v:variant)\n",
    "return d.display as name\n",
    "union\n",
    "match (d:drug)-[]-(m:chemical)<-[]-(dip:diplotype)\n",
    "return d.display as name\n",
    "union\n",
    "match (d:drug)-[]-(m:chemical)<-[]-(ge:gene)\n",
    "return d.display as name\"\"\")\n",
    "len(set([x[\"name\"] for x in result_list]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "id": "5b94fc2d",
   "metadata": {},
   "outputs": [],
   "source": [
    "def is_all_chinese(strs):\n",
    "    for _char in strs:\n",
    "        if not '\\u4e00' <= _char <= '\\u9fa5':\n",
    "            return False\n",
    "    return True"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "ffbfb8ad",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "is_all_chinese(\"小儿氨酚黄那敏顆粒\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "9958338f",
   "metadata": {},
   "outputs": [],
   "source": [
    "query_template = \"\"\"\n",
    "match (m:chemical)<-[]-(v:variant)\n",
    "where m.chemical_name = \"{chem_name}\"\n",
    "return m.chemical_name as chemical_name\n",
    "union\n",
    "match (m:chemical)<-[]-(dip:diplotype)\n",
    "where m.chemical_name = \"{chem_name}\"\n",
    "return m.chemical_name as chemical_name\n",
    "union\n",
    "match (m:chemical)<-[]-(ge:gene)\n",
    "where m.chemical_name = \"{chem_name}\"\n",
    "return m.chemical_name as chemical_name\n",
    "\"\"\"\n",
    "\n",
    "df_dm = pd.read_csv(\"c:/Users/zhangke1/Desktop/drug_mapping.tsv\", sep='\\t')\n",
    "drug_list = list(df_dm[\"Phenprocoumon\"].str.lower().str.strip().values)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "id": "71300a3b",
   "metadata": {},
   "outputs": [],
   "source": [
    "pgx_list= []\n",
    "for drug in drug_list:\n",
    "    result_list = n_util.run_cypher(query_template.format(chem_name=drug))\n",
    "    if len(result_list) > 0:\n",
    "        pgx_list.append(True)\n",
    "    else:\n",
    "        pgx_list.append(False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "id": "320f8f1e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>drug</th>\n",
       "      <th>pgx</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>nitrofurazone</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>furazolidone</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>aminobenzoic acid</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>rifampicin</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>glyceryl trinitrate</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>oral contraceptives</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>sodium phenylacetate and sodium benzoate</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                        drug    pgx\n",
       "15                             nitrofurazone  False\n",
       "16                              furazolidone  False\n",
       "27                         aminobenzoic acid  False\n",
       "39                                rifampicin  False\n",
       "41                       glyceryl trinitrate  False\n",
       "48                       oral contraceptives  False\n",
       "54  sodium phenylacetate and sodium benzoate  False"
      ]
     },
     "execution_count": 106,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 和bge匹配不上的药\n",
    "df_pgx = pd.DataFrame({\n",
    "    \"drug\": drug_list,\n",
    "    \"pgx\": pgx_list\n",
    "})\n",
    "\n",
    "df_pgx[~df_pgx[\"pgx\"]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "17c478ba",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3d49ce7a",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "id": "8d67cbd8",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_rare = pd.read_csv(\"data/罕见病审核.csv\").fillna(\"\")\n",
    "\n",
    "all_disease_list = []\n",
    "rare_relation_list = []\n",
    "\n",
    "for index, row in df_rare.iterrows():\n",
    "    disease_list_1 = row[\"适应症\"].split(\",\")\n",
    "    disease_list_2 = [x.split(\"/\")[0] for x in row[\"BGE亚型/Omim\"].split(\",\")]\n",
    "    disease_list = list(filter(lambda x: x!= \"\", set(disease_list_1 + disease_list_2)))\n",
    "    drug = row[\"药名\"]\n",
    "    all_disease_list.extend(disease_list)\n",
    "    for dis in disease_list:\n",
    "        rare_relation_list.append([drug, dis])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "id": "a4f63cc1",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[['注射用拉罗尼酶浓溶液', '黏多糖贮积症Ⅰ型'],\n",
       " ['注射用拉罗尼酶浓溶液', '黏多糖贮积症1S型'],\n",
       " ['注射用拉罗尼酶浓溶液', '黏多糖贮积症1H型'],\n",
       " ['艾度硫酸酯酶β注射液', '黏多糖贮积症Ⅱ型'],\n",
       " ['艾度硫酸酯酶β注射液', '亨特综合征'],\n",
       " ['艾度硫酸酯酶β注射液', '黏多糖贮积症2型'],\n",
       " ['注射用伊米苷酶', '戈谢病3型'],\n",
       " ['注射用伊米苷酶', '戈谢病1型'],\n",
       " ['注射用伊米苷酶', '戈谢病Ⅲ型'],\n",
       " ['注射用伊米苷酶', '戈谢病Ⅰ型'],\n",
       " ['注射用伊米苷酶', '戈谢病3C型'],\n",
       " ['注射用阿糖苷酶α', '酸性α葡萄糖苷酶缺乏症'],\n",
       " ['注射用阿糖苷酶α', '庞贝病'],\n",
       " ['注射用阿糖苷酶α', '糖原累积症II型'],\n",
       " ['阿加糖酶α注射用浓溶液', 'α-半乳糖苷酶 A 缺乏症'],\n",
       " ['阿加糖酶α注射用浓溶液', 'Fabry病'],\n",
       " ['阿加糖酶α注射用浓溶液', '法布雷病'],\n",
       " ['注射用阿加糖酶β', 'α-半乳糖苷酶 A 缺乏症'],\n",
       " ['注射用阿加糖酶β', 'Fabry病'],\n",
       " ['注射用阿加糖酶β', '法布雷病'],\n",
       " ['诺西那生钠注射液', '脊肌萎缩症1型'],\n",
       " ['诺西那生钠注射液', '脊肌萎缩症2型'],\n",
       " ['诺西那生钠注射液', '脊髓性肌萎缩症'],\n",
       " ['诺西那生钠注射液', '脊肌萎缩症4型'],\n",
       " ['诺西那生钠注射液', '脊肌萎缩症3型'],\n",
       " ['盐酸沙丙蝶呤片', '高苯丙氨酸血症'],\n",
       " ['盐酸沙丙蝶呤片', 'BH4缺乏性高苯丙氨酸血症C型'],\n",
       " ['盐酸沙丙蝶呤片', 'BH4缺乏性高苯丙氨酸血症A型'],\n",
       " ['盐酸沙丙蝶呤片', 'BH4缺乏性高苯丙氨酸血症B型'],\n",
       " ['盐酸沙丙蝶呤片', 'BH4缺乏性高苯丙氨酸血症D型'],\n",
       " ['硫培非格司亭注射液', '中性粒细胞减少症'],\n",
       " ['依库珠单抗注射液', '阵发性睡眠性血红蛋白尿症'],\n",
       " ['依库珠单抗注射液', '非典型溶血尿毒症综合征'],\n",
       " ['依库珠单抗注射液', '补体因子I缺乏症'],\n",
       " ['依库珠单抗注射液', '阵发性夜间血红蛋白尿2型'],\n",
       " ['依库珠单抗注射液', '血性尿毒症综合征'],\n",
       " ['依库珠单抗注射液', '补体因子B缺乏症'],\n",
       " ['依库珠单抗注射液', '补体C3缺乏症'],\n",
       " ['依洛硫酸酯酶α注射液', 'IVA型黏多糖贮积症'],\n",
       " ['依洛硫酸酯酶α注射液', '黏多糖贮积症4A型'],\n",
       " ['氘丁苯那嗪片', '亨廷顿病'],\n",
       " ['氘丁苯那嗪片', '迟发性运动障碍'],\n",
       " ['磷酸芦可替尼片', '继发的骨髓纤维化'],\n",
       " ['磷酸芦可替尼片', '慢性特发性骨髓纤维化'],\n",
       " ['磷酸芦可替尼片', '原发性骨髓纤维化'],\n",
       " ['磷酸芦可替尼片', '真性红细胞增多症'],\n",
       " ['磷酸芦可替尼片', '原发性血小板增多症'],\n",
       " ['注射用重组人凝血因子Ⅸ', '血友病'],\n",
       " ['注射用重组人凝血因子Ⅸ', '乙型血友病'],\n",
       " ['注射用重组人凝血因子Ⅷ', '甲型血友病'],\n",
       " ['注射用重组人凝血因子Ⅷ', '血友病'],\n",
       " ['吡非尼酮胶囊', '特发性肺间质纤维化'],\n",
       " ['注射用重组人凝血因子Ⅶa', 'VII因子缺乏症'],\n",
       " ['注射用重组人凝血因子Ⅶa', '血友病'],\n",
       " ['地拉罗司分散片', 'β地中海贫血'],\n",
       " ['地拉罗司分散片', 'α地中海贫血'],\n",
       " ['地拉罗司分散片', '地中海贫血症'],\n",
       " ['地拉罗司分散片', '铁质积聚'],\n",
       " ['波生坦片', '肺动脉高压'],\n",
       " ['波生坦片', '原发性肺动脉高压1型'],\n",
       " ['特立氟胺片', '复发型多发性硬化'],\n",
       " ['溴吡斯的明片', '尿潴留'],\n",
       " ['溴吡斯的明片', '手术后功能性肠胀气'],\n",
       " ['溴吡斯的明片', '重症肌无力']]"
      ]
     },
     "execution_count": 115,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rare_relation_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "id": "9daa8009",
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "node_list = []\n",
    "\n",
    "for disease in all_disease_list:\n",
    "    chemical_node = {\n",
    "        \"label\": [\"disease\"],\n",
    "        \"node_ID\": \"disease_name\",\n",
    "        \"property\": {\n",
    "            \"disease_name\": disease,\n",
    "            \"display\": disease\n",
    "        }\n",
    "    }\n",
    "    node_list.append(chemical_node)\n",
    "\n",
    "edge_list = []\n",
    "for rel in rare_relation_list:\n",
    "    disease_drug_edge = {\n",
    "        \"start_node\": {\n",
    "            \"label\": [\"drug\"],\n",
    "            \"node_ID\": \"drug_name\",\n",
    "            \"property\": {\n",
    "                \"drug_name\": rel[0]\n",
    "            }\n",
    "        },\n",
    "        \"end_node\": {\n",
    "            \"label\": [\"disease\"],\n",
    "            \"node_ID\": \"disease_name\",\n",
    "            \"property\": {\n",
    "                \"disease_name\": rel[1]\n",
    "            }\n",
    "        },\n",
    "        \"edge\": {\n",
    "            \"label\": \"treatment\",\n",
    "            \"property\": {}\n",
    "        }\n",
    "    }\n",
    "    edge_list.append(disease_drug_edge)\n",
    "    \n",
    "with open(\"json/rare_disease_nodes.json\", \"w\") as f:\n",
    "    json.dump(node_list, f)\n",
    "    \n",
    "    \n",
    "with open(\"json/rare_disease_edges.json\", \"w\") as f:\n",
    "    json.dump(edge_list, f)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 122,
   "id": "2e4a5122",
   "metadata": {},
   "outputs": [],
   "source": [
    "from src.util.neo4j_util import neo4jUtil as raw_n_util\n",
    "rn_util = raw_n_util(host=\"neo4j://172.16.231.80:7687\", user=\"neo4j\", password=\"123456\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 129,
   "id": "9ea3ebd4",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_list = []\n",
    "for n in node_list:\n",
    "    cypher = rn_util.gen_add_node_cypher(n)\n",
    "    cypher_list.append(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 130,
   "id": "117b88ab",
   "metadata": {},
   "outputs": [],
   "source": [
    "for e in edge_list:\n",
    "    cypher = rn_util.gen_add_edge_cypher(e)\n",
    "    cypher_list.append(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 132,
   "id": "6552a457",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MERGE (n:disease {disease_name:\"黏多糖贮积症Ⅰ型\"})\n",
      "SET n += {disease_name:\"黏多糖贮积症Ⅰ型\", display:\"黏多糖贮积症Ⅰ型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"黏多糖贮积症1S型\"})\n",
      "SET n += {disease_name:\"黏多糖贮积症1S型\", display:\"黏多糖贮积症1S型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"黏多糖贮积症1H型\"})\n",
      "SET n += {disease_name:\"黏多糖贮积症1H型\", display:\"黏多糖贮积症1H型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"黏多糖贮积症Ⅱ型\"})\n",
      "SET n += {disease_name:\"黏多糖贮积症Ⅱ型\", display:\"黏多糖贮积症Ⅱ型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"亨特综合征\"})\n",
      "SET n += {disease_name:\"亨特综合征\", display:\"亨特综合征\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"黏多糖贮积症2型\"})\n",
      "SET n += {disease_name:\"黏多糖贮积症2型\", display:\"黏多糖贮积症2型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"戈谢病3型\"})\n",
      "SET n += {disease_name:\"戈谢病3型\", display:\"戈谢病3型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"戈谢病1型\"})\n",
      "SET n += {disease_name:\"戈谢病1型\", display:\"戈谢病1型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"戈谢病Ⅲ型\"})\n",
      "SET n += {disease_name:\"戈谢病Ⅲ型\", display:\"戈谢病Ⅲ型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"戈谢病Ⅰ型\"})\n",
      "SET n += {disease_name:\"戈谢病Ⅰ型\", display:\"戈谢病Ⅰ型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"戈谢病3C型\"})\n",
      "SET n += {disease_name:\"戈谢病3C型\", display:\"戈谢病3C型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"酸性α葡萄糖苷酶缺乏症\"})\n",
      "SET n += {disease_name:\"酸性α葡萄糖苷酶缺乏症\", display:\"酸性α葡萄糖苷酶缺乏症\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"庞贝病\"})\n",
      "SET n += {disease_name:\"庞贝病\", display:\"庞贝病\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"糖原累积症II型\"})\n",
      "SET n += {disease_name:\"糖原累积症II型\", display:\"糖原累积症II型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"α-半乳糖苷酶 A 缺乏症\"})\n",
      "SET n += {disease_name:\"α-半乳糖苷酶 A 缺乏症\", display:\"α-半乳糖苷酶 A 缺乏症\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"Fabry病\"})\n",
      "SET n += {disease_name:\"Fabry病\", display:\"Fabry病\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"法布雷病\"})\n",
      "SET n += {disease_name:\"法布雷病\", display:\"法布雷病\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"α-半乳糖苷酶 A 缺乏症\"})\n",
      "SET n += {disease_name:\"α-半乳糖苷酶 A 缺乏症\", display:\"α-半乳糖苷酶 A 缺乏症\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"Fabry病\"})\n",
      "SET n += {disease_name:\"Fabry病\", display:\"Fabry病\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"法布雷病\"})\n",
      "SET n += {disease_name:\"法布雷病\", display:\"法布雷病\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"脊肌萎缩症1型\"})\n",
      "SET n += {disease_name:\"脊肌萎缩症1型\", display:\"脊肌萎缩症1型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"脊肌萎缩症2型\"})\n",
      "SET n += {disease_name:\"脊肌萎缩症2型\", display:\"脊肌萎缩症2型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"脊髓性肌萎缩症\"})\n",
      "SET n += {disease_name:\"脊髓性肌萎缩症\", display:\"脊髓性肌萎缩症\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"脊肌萎缩症4型\"})\n",
      "SET n += {disease_name:\"脊肌萎缩症4型\", display:\"脊肌萎缩症4型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"脊肌萎缩症3型\"})\n",
      "SET n += {disease_name:\"脊肌萎缩症3型\", display:\"脊肌萎缩症3型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"高苯丙氨酸血症\"})\n",
      "SET n += {disease_name:\"高苯丙氨酸血症\", display:\"高苯丙氨酸血症\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"BH4缺乏性高苯丙氨酸血症C型\"})\n",
      "SET n += {disease_name:\"BH4缺乏性高苯丙氨酸血症C型\", display:\"BH4缺乏性高苯丙氨酸血症C型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"BH4缺乏性高苯丙氨酸血症A型\"})\n",
      "SET n += {disease_name:\"BH4缺乏性高苯丙氨酸血症A型\", display:\"BH4缺乏性高苯丙氨酸血症A型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"BH4缺乏性高苯丙氨酸血症B型\"})\n",
      "SET n += {disease_name:\"BH4缺乏性高苯丙氨酸血症B型\", display:\"BH4缺乏性高苯丙氨酸血症B型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"BH4缺乏性高苯丙氨酸血症D型\"})\n",
      "SET n += {disease_name:\"BH4缺乏性高苯丙氨酸血症D型\", display:\"BH4缺乏性高苯丙氨酸血症D型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"中性粒细胞减少症\"})\n",
      "SET n += {disease_name:\"中性粒细胞减少症\", display:\"中性粒细胞减少症\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"阵发性睡眠性血红蛋白尿症\"})\n",
      "SET n += {disease_name:\"阵发性睡眠性血红蛋白尿症\", display:\"阵发性睡眠性血红蛋白尿症\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"非典型溶血尿毒症综合征\"})\n",
      "SET n += {disease_name:\"非典型溶血尿毒症综合征\", display:\"非典型溶血尿毒症综合征\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"补体因子I缺乏症\"})\n",
      "SET n += {disease_name:\"补体因子I缺乏症\", display:\"补体因子I缺乏症\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"阵发性夜间血红蛋白尿2型\"})\n",
      "SET n += {disease_name:\"阵发性夜间血红蛋白尿2型\", display:\"阵发性夜间血红蛋白尿2型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"血性尿毒症综合征\"})\n",
      "SET n += {disease_name:\"血性尿毒症综合征\", display:\"血性尿毒症综合征\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"补体因子B缺乏症\"})\n",
      "SET n += {disease_name:\"补体因子B缺乏症\", display:\"补体因子B缺乏症\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"补体C3缺乏症\"})\n",
      "SET n += {disease_name:\"补体C3缺乏症\", display:\"补体C3缺乏症\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"IVA型黏多糖贮积症\"})\n",
      "SET n += {disease_name:\"IVA型黏多糖贮积症\", display:\"IVA型黏多糖贮积症\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"黏多糖贮积症4A型\"})\n",
      "SET n += {disease_name:\"黏多糖贮积症4A型\", display:\"黏多糖贮积症4A型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"亨廷顿病\"})\n",
      "SET n += {disease_name:\"亨廷顿病\", display:\"亨廷顿病\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"迟发性运动障碍\"})\n",
      "SET n += {disease_name:\"迟发性运动障碍\", display:\"迟发性运动障碍\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"继发的骨髓纤维化\"})\n",
      "SET n += {disease_name:\"继发的骨髓纤维化\", display:\"继发的骨髓纤维化\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"慢性特发性骨髓纤维化\"})\n",
      "SET n += {disease_name:\"慢性特发性骨髓纤维化\", display:\"慢性特发性骨髓纤维化\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"原发性骨髓纤维化\"})\n",
      "SET n += {disease_name:\"原发性骨髓纤维化\", display:\"原发性骨髓纤维化\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"真性红细胞增多症\"})\n",
      "SET n += {disease_name:\"真性红细胞增多症\", display:\"真性红细胞增多症\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"原发性血小板增多症\"})\n",
      "SET n += {disease_name:\"原发性血小板增多症\", display:\"原发性血小板增多症\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"血友病\"})\n",
      "SET n += {disease_name:\"血友病\", display:\"血友病\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"乙型血友病\"})\n",
      "SET n += {disease_name:\"乙型血友病\", display:\"乙型血友病\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"甲型血友病\"})\n",
      "SET n += {disease_name:\"甲型血友病\", display:\"甲型血友病\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"血友病\"})\n",
      "SET n += {disease_name:\"血友病\", display:\"血友病\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"特发性肺间质纤维化\"})\n",
      "SET n += {disease_name:\"特发性肺间质纤维化\", display:\"特发性肺间质纤维化\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"VII因子缺乏症\"})\n",
      "SET n += {disease_name:\"VII因子缺乏症\", display:\"VII因子缺乏症\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"血友病\"})\n",
      "SET n += {disease_name:\"血友病\", display:\"血友病\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"β地中海贫血\"})\n",
      "SET n += {disease_name:\"β地中海贫血\", display:\"β地中海贫血\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"α地中海贫血\"})\n",
      "SET n += {disease_name:\"α地中海贫血\", display:\"α地中海贫血\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"地中海贫血症\"})\n",
      "SET n += {disease_name:\"地中海贫血症\", display:\"地中海贫血症\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"铁质积聚\"})\n",
      "SET n += {disease_name:\"铁质积聚\", display:\"铁质积聚\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"肺动脉高压\"})\n",
      "SET n += {disease_name:\"肺动脉高压\", display:\"肺动脉高压\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"原发性肺动脉高压1型\"})\n",
      "SET n += {disease_name:\"原发性肺动脉高压1型\", display:\"原发性肺动脉高压1型\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"复发型多发性硬化\"})\n",
      "SET n += {disease_name:\"复发型多发性硬化\", display:\"复发型多发性硬化\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"尿潴留\"})\n",
      "SET n += {disease_name:\"尿潴留\", display:\"尿潴留\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"手术后功能性肠胀气\"})\n",
      "SET n += {disease_name:\"手术后功能性肠胀气\", display:\"手术后功能性肠胀气\"}\n",
      "\n",
      "\n",
      "\n",
      "MERGE (n:disease {disease_name:\"重症肌无力\"})\n",
      "SET n += {disease_name:\"重症肌无力\", display:\"重症肌无力\"}\n",
      "\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用拉罗尼酶浓溶液\" AND\n",
      "e.disease_name = \"黏多糖贮积症Ⅰ型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用拉罗尼酶浓溶液\" AND\n",
      "e.disease_name = \"黏多糖贮积症1S型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用拉罗尼酶浓溶液\" AND\n",
      "e.disease_name = \"黏多糖贮积症1H型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"艾度硫酸酯酶β注射液\" AND\n",
      "e.disease_name = \"黏多糖贮积症Ⅱ型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"艾度硫酸酯酶β注射液\" AND\n",
      "e.disease_name = \"亨特综合征\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"艾度硫酸酯酶β注射液\" AND\n",
      "e.disease_name = \"黏多糖贮积症2型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用伊米苷酶\" AND\n",
      "e.disease_name = \"戈谢病3型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用伊米苷酶\" AND\n",
      "e.disease_name = \"戈谢病1型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用伊米苷酶\" AND\n",
      "e.disease_name = \"戈谢病Ⅲ型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用伊米苷酶\" AND\n",
      "e.disease_name = \"戈谢病Ⅰ型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用伊米苷酶\" AND\n",
      "e.disease_name = \"戈谢病3C型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用阿糖苷酶α\" AND\n",
      "e.disease_name = \"酸性α葡萄糖苷酶缺乏症\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用阿糖苷酶α\" AND\n",
      "e.disease_name = \"庞贝病\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用阿糖苷酶α\" AND\n",
      "e.disease_name = \"糖原累积症II型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"阿加糖酶α注射用浓溶液\" AND\n",
      "e.disease_name = \"α-半乳糖苷酶 A 缺乏症\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"阿加糖酶α注射用浓溶液\" AND\n",
      "e.disease_name = \"Fabry病\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"阿加糖酶α注射用浓溶液\" AND\n",
      "e.disease_name = \"法布雷病\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用阿加糖酶β\" AND\n",
      "e.disease_name = \"α-半乳糖苷酶 A 缺乏症\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用阿加糖酶β\" AND\n",
      "e.disease_name = \"Fabry病\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用阿加糖酶β\" AND\n",
      "e.disease_name = \"法布雷病\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"诺西那生钠注射液\" AND\n",
      "e.disease_name = \"脊肌萎缩症1型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"诺西那生钠注射液\" AND\n",
      "e.disease_name = \"脊肌萎缩症2型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"诺西那生钠注射液\" AND\n",
      "e.disease_name = \"脊髓性肌萎缩症\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"诺西那生钠注射液\" AND\n",
      "e.disease_name = \"脊肌萎缩症4型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"诺西那生钠注射液\" AND\n",
      "e.disease_name = \"脊肌萎缩症3型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"盐酸沙丙蝶呤片\" AND\n",
      "e.disease_name = \"高苯丙氨酸血症\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"盐酸沙丙蝶呤片\" AND\n",
      "e.disease_name = \"BH4缺乏性高苯丙氨酸血症C型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"盐酸沙丙蝶呤片\" AND\n",
      "e.disease_name = \"BH4缺乏性高苯丙氨酸血症A型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"盐酸沙丙蝶呤片\" AND\n",
      "e.disease_name = \"BH4缺乏性高苯丙氨酸血症B型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"盐酸沙丙蝶呤片\" AND\n",
      "e.disease_name = \"BH4缺乏性高苯丙氨酸血症D型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"硫培非格司亭注射液\" AND\n",
      "e.disease_name = \"中性粒细胞减少症\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"依库珠单抗注射液\" AND\n",
      "e.disease_name = \"阵发性睡眠性血红蛋白尿症\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"依库珠单抗注射液\" AND\n",
      "e.disease_name = \"非典型溶血尿毒症综合征\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"依库珠单抗注射液\" AND\n",
      "e.disease_name = \"补体因子I缺乏症\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"依库珠单抗注射液\" AND\n",
      "e.disease_name = \"阵发性夜间血红蛋白尿2型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"依库珠单抗注射液\" AND\n",
      "e.disease_name = \"血性尿毒症综合征\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"依库珠单抗注射液\" AND\n",
      "e.disease_name = \"补体因子B缺乏症\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"依库珠单抗注射液\" AND\n",
      "e.disease_name = \"补体C3缺乏症\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"依洛硫酸酯酶α注射液\" AND\n",
      "e.disease_name = \"IVA型黏多糖贮积症\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"依洛硫酸酯酶α注射液\" AND\n",
      "e.disease_name = \"黏多糖贮积症4A型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"氘丁苯那嗪片\" AND\n",
      "e.disease_name = \"亨廷顿病\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"氘丁苯那嗪片\" AND\n",
      "e.disease_name = \"迟发性运动障碍\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"磷酸芦可替尼片\" AND\n",
      "e.disease_name = \"继发的骨髓纤维化\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"磷酸芦可替尼片\" AND\n",
      "e.disease_name = \"慢性特发性骨髓纤维化\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"磷酸芦可替尼片\" AND\n",
      "e.disease_name = \"原发性骨髓纤维化\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"磷酸芦可替尼片\" AND\n",
      "e.disease_name = \"真性红细胞增多症\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"磷酸芦可替尼片\" AND\n",
      "e.disease_name = \"原发性血小板增多症\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用重组人凝血因子Ⅸ\" AND\n",
      "e.disease_name = \"血友病\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用重组人凝血因子Ⅸ\" AND\n",
      "e.disease_name = \"乙型血友病\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用重组人凝血因子Ⅷ\" AND\n",
      "e.disease_name = \"甲型血友病\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用重组人凝血因子Ⅷ\" AND\n",
      "e.disease_name = \"血友病\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"吡非尼酮胶囊\" AND\n",
      "e.disease_name = \"特发性肺间质纤维化\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用重组人凝血因子Ⅶa\" AND\n",
      "e.disease_name = \"VII因子缺乏症\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"注射用重组人凝血因子Ⅶa\" AND\n",
      "e.disease_name = \"血友病\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"地拉罗司分散片\" AND\n",
      "e.disease_name = \"β地中海贫血\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"地拉罗司分散片\" AND\n",
      "e.disease_name = \"α地中海贫血\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"地拉罗司分散片\" AND\n",
      "e.disease_name = \"地中海贫血症\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"地拉罗司分散片\" AND\n",
      "e.disease_name = \"铁质积聚\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"波生坦片\" AND\n",
      "e.disease_name = \"肺动脉高压\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"波生坦片\" AND\n",
      "e.disease_name = \"原发性肺动脉高压1型\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"特立氟胺片\" AND\n",
      "e.disease_name = \"复发型多发性硬化\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"溴吡斯的明片\" AND\n",
      "e.disease_name = \"尿潴留\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"溴吡斯的明片\" AND\n",
      "e.disease_name = \"手术后功能性肠胀气\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n",
      "\n",
      "\n",
      "MATCH (s:drug), (e:disease)\n",
      "WHERE\n",
      "s.drug_name = \"溴吡斯的明片\" AND\n",
      "e.disease_name = \"重症肌无力\" \n",
      "MERGE\n",
      "(s) -[r:treatment]-> (e)\n"
     ]
    }
   ],
   "source": [
    "print(\"\\n\\n\\n\".join(cypher_list))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 133,
   "id": "d202e91f",
   "metadata": {},
   "outputs": [],
   "source": [
    "# for c in cypher_list:\n",
    "#     n_util.run_cypher(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "489f0e1f",
   "metadata": {},
   "outputs": [],
   "source": [
    "with open(\"processed/drug_dict.json\", \"r\") as f:\n",
    "    d_dict = json.load(f)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "ff4f6c41",
   "metadata": {},
   "outputs": [],
   "source": [
    "column_list = {\n",
    "    \"成份\": \"component\",\n",
    "    \"性状\": \"character\",\n",
    "    \"适应症\": \"indication\",\n",
    "    \"用法用量\": \"dosage\",\n",
    "    \"不良反应\": \"adverse_reaction\",\n",
    "    \"禁忌\": \"avoid\",\n",
    "    \"注意事项\": \"attention_notice\",\n",
    "    \"孕妇及哺乳期妇女用药\": \"pregnant_attention\",\n",
    "    \"儿童用药\": \"children_attention\",\n",
    "    \"老年用药\": \"older_attention\",\n",
    "    \"贮藏\": \"storage\",\n",
    "    \"规格\": \"specification\",\n",
    "    \"药物相互作用\": \"drug_interaction\",\n",
    "    \"药理毒理\": \"pharmacology_toxicology\",\n",
    "    \"药代动力学\": \"pharmacokinetics\",\n",
    "    \"药物过量\": \"drug_overdose\",\n",
    "    \"有效期\": \"expiry_date\",\n",
    "    \"包装\": \"package\",\n",
    "    \"执行标准\": \"standard\",\n",
    "    \"是否医保\": \"in_medical_insurance\",\n",
    "    \"甲乙\": \"insurance_level\"\n",
    "}\n",
    "\n",
    "dc_dict = dict()\n",
    "dc_dict[\"drug_name\"] = []\n",
    "for col in column_list.values():\n",
    "    dc_dict[col] = []\n",
    "\n",
    "for key, value in d_dict.items():\n",
    "    dc_dict[\"drug_name\"].append(key)\n",
    "    for col, cn in column_list.items():\n",
    "        if col in value.keys():\n",
    "            dc_dict[cn].append(value[col])\n",
    "        else:\n",
    "            dc_dict[cn].append(\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "7f3b88bf",
   "metadata": {},
   "outputs": [],
   "source": [
    "pd.DataFrame(dc_dict).to_csv(\"processed/all_drug_description.csv\", index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "6be753a0",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_no_desc_drug = pd.DataFrame(n_util.run_cypher(\"\"\"\n",
    "MATCH (n:drug) \n",
    "where n.indication = \"\"\n",
    "RETURN n.drug_name as drug_name\n",
    "\"\"\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "7e7be9c5",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_no_desc_drug.to_csv(\"d:/ticket/processed/no_desc_drug.csv\", index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9d600f1d",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
